-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Apr 28, 2026 at 03:09 AM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `touring`
--

-- --------------------------------------------------------

--
-- Table structure for table `attraction`
--

CREATE TABLE `attraction` (
  `att_id` int(10) NOT NULL,
  `att_name` varchar(255) NOT NULL,
  `category_id` int(8) NOT NULL,
  `description` text NOT NULL,
  `price` decimal(10,2) NOT NULL,
  `Seat` int(55) NOT NULL,
  `image` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `attraction`
--

INSERT INTO `attraction` (`att_id`, `att_name`, `category_id`, `description`, `price`, `Seat`, `image`) VALUES
(1, 'อุทยานแห่งชาติหมู่เกาะสิมิลัน', 4, 'อุทยานแห่งชาติหมู่ดกาะสิมิลัน จ.พังงา ดินแดนที่อุดมไปด้วยผืนน้ำทะเลสีฟ้าเทอร์ควอยซ์ มีเกาะหลัก ๆ ทั้งหมด 11 เกาะ ได้แก่ เกาะหูยง (เกาะหนึ่ง), เกาะปายัง (เกาะสอง), เกาะปาหยัน (เกาะสาม), เกาะเมียง (เกาะสี่), เกาะห้า, เกาะหก, เกาะปายู (เกาะเจ็ด), เกาะสิมิลัน (เกาะแปด), เกาะบางู (เกาะเก้า), เกาะตาชัย และเกาะบอน ซึ่งล้วนแต่มีหาดทรายที่สวยงาม พร้อมกับแนวปะการังที่อุดมสมบูรณ์ นักท่องเที่ยวจะได้พบเห็นสัตว์ทะเลที่หลากหลาย นอกจากนี้หมู่เกาะสิมิลันยังมีเส้นทางศึกษาธรรมชาติและจุดชมวิวที่สวยงามตามเกาะต่าง ๆ อีกด้วย ทั้งนี้อุทยานแห่งชาติหมู่เกาะสิมิลัน จะเปิดให้นักท่องเที่ยวเข้าเที่ยวชมตั้งแต่วันที่ 16 ตุลาคม - 15 พฤษภาคม ของทุกปี', 2500.00, 30, '1776413015.jpg'),
(2, 'อุทยานแห่งชาติหมู่เกาะสุรินทร์', 4, 'สวรรค์แห่งการดำน้ำที่ใคร ๆ ต่างก็ต้องการมาสัมผัสสักครั้ง เกาะต่าง ๆ เต็มไปด้วยแนวปะการังหลากสีสัน เป็นสถานที่ดำน้ำลึกและน้ำตื้นยอดนิยมของคนทั่วโลก ผืนน้ำทะเลใสสะอาด พร้อมทั้งหาดทรายยังขาวเนียนนุ่ม มองดูโดดเด่นกลางทะเลอันดามัน บอกเลยว่าพลาดไม่ได้ ทั้งนี้อุทยานแห่งชาติหมู่เกาะสุรินทร์จะเปิดให้นักท่องเที่ยวเข้าเที่ยวชมตั้งแต่วันที่ 16 ตุลาคม - 15 พฤษภาคม ของทุกปี', 3000.00, 40, '1776671234.jpg'),
(3, 'หมู่เกาะพีพี', 4, 'หมู่เกาะที่เป็นส่วนหนึ่งของอุทยานแห่งชาติหาดนพรัตน์ธารา-หมู่เกาะพีพี โดยมีภาพของเวิ้งอ่าวคู่ อันเป็นสัญลักษณ์ของเกาะพีพี ที่ดึงดูดให้นักท่องเที่ยวทั่วโลกมาเยือนทะเลไทยอย่างมากมาย หาดทรายขาวของทั้งอ่าวต้นไทรและอ่าวโละดาลัม พร้อมทั้งน้ำทะเลใส สร้างความประทับใจให้กับนักท่องเที่ยวตลอดมา อีกทั้งอ่าวมาหยาอันเลื่องชื่อ ซึ่งอยู่ท่ามกลางอ้อมกอดของภูเขาหินปูน จะทำให้คุณจดจำเกาะพีพีไม่มีวันลืม', 4000.00, 35, '1776680676.jpg'),
(4, 'เกาะหลีเป๊ะ', 4, 'เกาะหลีเป๊ะ จังหวัดสตูล สัมผัสหาดทรายขาวสะอาด น้ำทะเลสีฟ้าครามใส พร้อมทั้งแนวปะการังที่อุดมสมบูรณ์ และยังชุกชุมไปด้วยปลาและสัตว์ทะเลอีกหลากหลายชนิดของเกาะหลีเป๊ะ เรียนรู้วิถีชีวิตชาวอูรักลาโว้ย และร่วมสนุกสนานกับสีสันบนเกาะเล็ก ๆ กลางทะเลอันดามันที่คุณจะไม่มีวันลืม', 3250.00, 25, '1776680716.jpg'),
(5, 'เกาะรอก', 4, 'เกาะรอก จังหวัดกระบี่ เจ้าของฉายาราชินีแห่งอันดามัน ด้วยธรรมชาติทั้งป่าเขาบนเกาะและธรรมชาติใต้ท้องทะเลยังคงมีความอุดมสมบูรณ์อย่างมาก มีหาดทรายขาวสะอาดโดดเด่น น้ำทะเลเป็นสีฟ้าใส สามารถมองเห็นใต้ทะเลได้อย่างชัดเจน อีกทั้งยังมีแนวปะการังหลากสีสัน ที่นี่จึงกลายเป็นจุดดำน้ำยอดนิยมสำหรับคนรักการดำน้ำ', 2500.00, 40, '1776680757.jpg'),
(6, 'เกาะนางยวน', 4, 'เกาะนางยวน จังหวัดสุราษฎร์ธานี เกาะเล็ก ๆ ที่เงียบสงบ ตั้งอยู่ข้างเกาะเต่า ประกอบด้วยเกาะเล็ก ๆ 3 เกาะ เชื่อมต่อด้วยแนวสันทรายสีขาวสะอาดตา ล้อมรอบไปด้วยน้ำทะเลสีฟ้าใสอย่างงดงาม เป็นเอกลักษณ์ที่ทำให้คนทั่วโลกรู้จักเกาะนางยวน ซึ่งเป็นเพียงเกาะเล็ก ๆ กลางอ่าวไทยที่เงียบสงบ มีแนวปะการังสวยงาม เป็นสวรรค์ของนักดำน้ำที่ต้องมาเยือนกันสักครั้ง', 2550.00, 30, '1776680808.jpg'),
(7, 'เกาะช้าง', 4, 'เกาะช้าง จังหวัดตราด เกาะที่ใหญ่ที่สุดเป็นอันดับ 2 ของเมืองไทย แห่งท้องทะเลตราด เพียบพร้อมไปด้วยทรัพยากรทางธรรมชาติทั้งป่าเขาและท้องทะเลที่สวยงาม อีกทั้งยังมีสิ่งอำนวยความสะดวกครบครัน เป็นสถานที่ชมพระอาทิตย์ตกทะเลที่สวยงามที่สุดแห่งหนึ่งของเมืองไทย หากใครได้มาดินเนอร์ริมชายหาดที่เกาะแห่งนี้...บอกเลยว่าจะฟินมาก !', 3500.00, 50, '1776680843.jpg'),
(8, 'ภูกระดึง', 5, 'ภูกระดึง จังหวัดเลย เส้นทางเดินป่าสุดคลาสสิกที่ต้องไปลองพิชิตกันให้ได้สักครั้งในชีวิต ซึ่งตลอดเส้นทางนักท่องเที่ยวจะได้พบเห็นต้นไม้ป่า ดอกไม้ป่านานาพรรณ พร้อมกับจุดท่องเที่ยวมากมาย ยิ่งในช่วงที่ใบเมเปิลเปลี่ยนสีจะยิ่งสวยงาม ซึ่งส่วนใหญ่ต้นเมเปิลจะตั้งอยู่บริเวณริมน้ำตก เมื่อใบเมเปิลสีแดงสดร่วงลงสู่โขดหินที่มีตะไคร่น้ำสีเขียว บริเวณนี้จะงดงามมากจนกลายเป็นจุดถ่ายภาพที่ห้ามพลาดไปเลยทีเดียว นอกจากนี้ภูกระดึงยังมีจุดที่น่าสนใจ เช่น ผานกนางแอ่น, ผาหล่มสัก, สระอโนดาต, น้ำตกวังกวาง, น้ำตกเพ็ญพบใหม่ และน้ำตกโผนพบ ฯลฯ\r\n', 4200.00, 30, '1776680897.jpg'),
(9, 'ดอยอ่างขาง', 5, 'ดอยอ่างขาง จังหวัดเชียงใหม่ สถานที่ท่องเที่ยวที่เหมาะสำหรับการไปพักผ่อนกับธรรมชาติอย่างแท้จริง ด้วยตั้งอยู่บนยอดดอยสูง ซึ่งโอบล้อมไปด้วยภูเขามากมาย อีกทั้งยังมีธรรมชาติที่อุดมสมบูรณ์ ทำให้ที่นี่มีอากาศหนาวเย็นตลอดทั้งปี ภายในสถานีเกษตรหลวงอ่างขางมีเพียงแปลงปลูกพืชพรรณต่าง ๆ และบริเวณรอบ ๆ ก็มีเพียงหมู่บ้านของชาวไทยภูเขาเท่านั้น บรรยากาศจึงเงียบสงบ ใครที่กำลังมองหาสักสถานที่เพื่อการพักผ่อนอย่างจริงจัง ต้องลองมาสัมผัสอ่างขางสักครั้งแล้วคุณจะหลงรักที่นี่แน่นอน', 4000.00, 35, '1776680946.jpg'),
(10, 'ภูสอยดาว', 5, 'ภูสอยดาว จังหวัดพิษณุโลก, จังหวัดอุตรดิตถ์ อุทยานแห่งชาติภูสอยดาว หรือที่เรียกกันว่า \"ภูสอยดาว\" ตั้งอยู่ภายในเขตป่าสงวนแห่งชาติป่าน้ำปาด โดยช่วงที่สวยที่สุดจะอยู่ในช่วงเข้าฤดูฝนเต็มตัวประมาณเดือนสิงหาคม-กันยายน ซึ่งเป็นช่วงที่การเดินป่าภูสอยดาวมีทั้งความสนุก น่าตื่นเต้น และท้าทายมากที่สุด แถมยังได้ชมความงามของลานดอกไม้ป่าที่ละลานตา มีทั้งดอกหงอนนาค, ดอกหญ้ารากหอม, ดอกสร้อยสุวรรณา และดอกกระดุมเงิน ฯลฯ แต่ในช่วงหน้าหนาวนักท่องเที่ยวก็นิยมไปนอนสัมผัสกับอากาศหนาวเช่นกัน', 3700.00, 40, '1776680980.jpg'),
(11, 'ดอยหลวงเชียงดาว', 5, 'ดอยหลวงเชียงดาว จังหวัดเชียงใหม่ ตั้งอยู่ในเขตรักษาพันธุ์สัตว์ป่าเชียงดาว นับเป็นภูเขาหินปูนรูปร่างสวยงามแปลกตาในอำเภอเชียงดาว จังหวัดเชียงใหม่ มีความสูงจากระดับน้ำทะเลมากกว่า 2,225 เมตร สูงเป็นอันดับ 3 ของเมืองไทย ผจญภัยไปกับเส้นทางเดินป่าสุดประทับใจ เพื่อพิชิตยอดดอย แล้วไปนอนมองทะเลดาวและทะเลหมอกสุดอลังการจากด้านบน เป็นประสบการณ์ที่คุณต้องจดจำไปตลอดแน่นอน', 4000.00, 35, '1776681051.jpg'),
(12, 'อุทยานประวัติศาสตร์พระนครศรีอยุธยา', 3, 'อุทยานประวัติศาสตร์พระนครศรีอยุธยา ตั้งอยู่ภายในเกาะเมืองอยุธยา เขตเทศบาลเมืองพระนครศรีอยุธยา เป็นราชธานีเก่าแก่อันยิ่งใหญ่ที่สืบเนื่องยาวนาน โดยมีศิลปวัฒนธรรมอันยิ่งใหญ่ งดงาม และทรงคุณค่า จนได้รับการเชิดชูคุณค่าไว้ในบัญชีรายชื่อแหล่งมรดกโลกขององค์การยูเนสโกในปี พ.ศ. 2534 ซึ่งจุดท่องเที่ยวหลัก ๆ เช่น พระราชวังโบราณหรือพระราชวังหลวง ที่ประทับของพระมหากษัตริย์ในสมัยกรุงศรีอยุธยา, วัดพระศรีสรรเพชญ์ พระราชวังที่ประทับของสมเด็จพระรามาธิบดีที่ 1 (พระเจ้าอู่ทอง) วัดราชบูรณะ รวมไปถึงวิหารพระมงคลบพิตร ซึ่งมีพระมงคลบพิตรที่เป็นพระพุทธรูปบุทองสัมฤทธิ์องค์ใหญ่ที่สุดองค์หนึ่งในประเทศไทย นอกจากนี้ภายในเขตอุทยานยังคงมีโบราณสถานที่สำคัญอีกหลายแห่งให้ได้ขับรถเที่ยวชม', 3200.00, 28, '1776681099.jpg'),
(13, 'สามพันโบก', 5, 'สามพันโบก จังหวัดอุบลราชธานี อันซีนไทยแลนด์ที่ตั้งอยู่กลางลำน้ำโขงในเขตพื้นที่บ้านโป่งเป้า บ้านสองคอน อำเภอโพธิ์ไทร ถือเป็นที่เที่ยวสุดอัศจรรย์และน่าไปเยือนเมื่อไปเที่ยวอุบลราชธานี มีลักษณะเป็นแก่งหินที่โผล่ขึ้นมากลางลำน้ำโขงในช่วงที่น้ำลด โดยที่แก่งหินเหล่านี้ก็จะมีแอ่งน้อยใหญ่ ทำให้หลายคนขนานนามให้ที่นี่เป็น \"แกรนด์แคนยอนเมืองไทย\" เลยทีเดียว', 3500.00, 36, '1776681133.jpg'),
(14, 'ตลาดน้ำอัมพวา', 3, 'ตลาดน้ำอัมพวา จังหวัดสมุทรสงคราม ตลาดน้ำยอดฮิตแห่งจังหวัดสมุทรสงคราม ซึ่งนอกเหนือไปจากการเดินเที่ยว ช้อป และชิมกันรัว ๆ แล้ว นักท่องเที่ยวยังจะได้สัมผัสธรรมชาติของวิถีชีวิตริมน้ำ ซึ่งเป็นภาพที่น่าประทับใจอย่างยิ่ง กิจกรรมท่องเที่ยวตลาดน้ำอัมพวาที่นักท่องเที่ยวไม่ควรพลาด ได้แก่ ชิมอาหารพื้นบ้านทั้งคาว-หวาน, เดินเยี่ยมชมร้านค้าขายของที่ระลึกและวิถีชีวิตชาวบ้าน, ล่องเรือชมวิวทิวทัศน์แม่น้ำแม่กลองและหิ่งห้อย เที่ยวเสร็จก็นอนค้างอัมพวาสักคืน แนะนำว่าให้นอนไกลตลาดน้ำไปสักหน่อย ตกกลางคืนก็มานั่งเล่นริมระเบียง แล้วคุณจะต้องหลงรักอัมพวาเข้าอย่างจัง', 2000.00, 25, '1776681184.jpg'),
(15, 'วัดพระเชตุพนวิมลมังคลาราม (วัดโพธิ์)', 3, 'วัดพระเชตุพนวิมลมังคลาราม (วัดโพธิ์) กรุงเทพฯ วัดที่เก่าแก่ที่สุดอีกวัดหนึ่งในประเทศไทย ก่อตั้งมาประมาณ 200 ปีก่อนจะมีประเทศไทยซะอีก ที่สำคัญวัดโพธิ์ยังมีพระพุทธไสยาสน์ หรือพระนอนองค์ใหญ่ที่สุดในประเทศไทยประดิษฐานเป็นเอกลักษณ์ที่งดงาม สร้างชื่อเสียงไปทั่วโลกอีกด้วย อีกทั้งทิวทัศน์และวิถีชาวบ้านละแวกนั้น ยังเป็นธรรมชาติที่น่าประทับใจมาก ๆ ในสายตานักท่องเที่ยวอีกด้วย', 2500.00, 27, '1776681219.jpg'),
(16, 'วัดพระธาตุดอยสุเทพราชวรวิหาร', 3, 'วัดพระธาตุดอยสุเทพราชวรวิหาร จังหวัดเชียงใหม่ วัดเก่าแก่ที่มีความศักดิ์สิทธิ์มากวัดหนึ่งของประเทศไทย ซึ่งมีความสำคัญในแง่ประวัติศาสตร์ เป็นวัดคู่บ้านคู่เมืองที่ห้ามพลาดเมื่อมาถึงจังหวัดเชียงใหม่ ภายในเป็นที่ประดิษฐานขององค์เจดีย์ทรงมอญ ที่ใต้ฐานพระเจดีย์มีพระบรมสารีริกธาตุของสมเด็จพระสัมมาสัมพุทธเจ้าบรรจุอยู่ ซึ่งจัดได้ว่าเป็นปูชนียสถานที่แสดงออกถึงศิลปกรรมล้านนาไทยที่สำคัญคู่เมืองเชียงใหม่มาช้านาน นักท่องเที่ยวสามารถขึ้นมาชมความงดงามขององค์เจดีย์พร้อมกับชมทิวทัศน์โดยรอบของตัวเมืองเชียงใหม่ได้', 3200.00, 30, '1776681251.jpg'),
(17, 'วัดร่องขุ่น', 3, 'วัดร่องขุ่น จังหวัดเชียงราย ศาสนสถานที่สำคัญแห่งหนึ่งของจังหวัดเชียงราย ตั้งอยู่ที่ตำบลป่าอ้อดอนชัย อำเภอเมือง ถือเป็นเป็นผลงานการออกแบบและก่อสร้างโดย อาจารย์เฉลิมชัย โฆษิตพิพัฒน์ ศิลปินแห่งชาติ สาขาทัศนศิลป์ (จิตรกรรม) ประจำปี 2554 มีผลงานจิตรกรรมไทยหลากหลาย ผู้ซึ่งอุทิศตนสร้างวัดร่องขุ่นอันยิ่งใหญ่นี้ขึ้นเพื่อถวายเป็นพุทธบูชา ด้วยความตั้งใจที่จะสร้างสรรค์ให้วัดแห่งนี้งดงามดังสวรรค์ที่มีอยู่จริง อีกทั้งมนุษย์สามารถสัมผัสได้บนพื้นพิภพ คล้ายเป็นสิ่งกระตุ้นเตือนให้คนเราใฝ่ปฏิบัติธรรม และประกอบแต่กรรมดีในการดำเนินชีวิต\r\n', 3500.00, 29, '1776681285.jpg');

-- --------------------------------------------------------

--
-- Table structure for table `bookings`
--

CREATE TABLE `bookings` (
  `booking_id` int(10) NOT NULL,
  `cust_id` int(8) NOT NULL,
  `att_id` int(10) NOT NULL,
  `emp_id` int(8) DEFAULT NULL,
  `booking_date` datetime NOT NULL,
  `travel_date` datetime NOT NULL,
  `num_people` int(5) NOT NULL,
  `total_price` decimal(10,2) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `bookings`
--

INSERT INTO `bookings` (`booking_id`, `cust_id`, `att_id`, `emp_id`, `booking_date`, `travel_date`, `num_people`, `total_price`) VALUES
(5, 1, 15, 0, '2026-04-22 16:32:59', '2026-04-25 00:00:00', 3, 7500.00),
(6, 1, 17, 0, '2026-04-22 16:33:10', '2026-04-29 00:00:00', 1, 3500.00),
(7, 1, 12, 0, '2026-04-22 16:35:04', '2026-04-27 00:00:00', 2, 6400.00),
(9, 1, 13, NULL, '2026-04-23 11:44:53', '2026-04-30 00:00:00', 4, 14000.00);

-- --------------------------------------------------------

--
-- Table structure for table `categories`
--

CREATE TABLE `categories` (
  `category_id` int(4) NOT NULL,
  `category_name` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `categories`
--

INSERT INTO `categories` (`category_id`, `category_name`) VALUES
(1, 'Sea'),
(3, 'Temple'),
(4, 'Island'),
(5, 'Mountain'),
(6, 'Waterfall');

-- --------------------------------------------------------

--
-- Table structure for table `customers`
--

CREATE TABLE `customers` (
  `cust_id` int(8) UNSIGNED ZEROFILL NOT NULL,
  `cfull_name` varchar(80) NOT NULL,
  `phone` varchar(12) NOT NULL,
  `email` varchar(50) NOT NULL,
  `c_username` varchar(20) NOT NULL,
  `c_password` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `customers`
--

INSERT INTO `customers` (`cust_id`, `cfull_name`, `phone`, `email`, `c_username`, `c_password`) VALUES
(00000001, 'suthida Ruangsuksud', '0900826952', 'suthida12679@gmail.com', 'test', '$2y$10$j0r8w6jXlF0i54ivvrZqYegiRzUIdoT15Tr3rcYyruqkF8c.8BKzu'),
(00000003, 'sutin rss', '0831190572', 'sutin722@hotmail.com', 'sutin', '$2y$10$zXb9LMyXbvx9rVtRP8Tyx.6WzKWB5wl653ToArjK1rBVQbmbWozJC'),
(00000004, 'lalisa manobal', '0854695969', 'lalisa@gmail.com', 'lisa', '$2y$10$HaMZ6CTwl9ii/3GYcjoPxen0jrdgEl201PTh/InzC2sNJHTY/G2ay');

-- --------------------------------------------------------

--
-- Table structure for table `employee`
--

CREATE TABLE `employee` (
  `emp_id` int(8) UNSIGNED ZEROFILL NOT NULL,
  `efull_name` varchar(80) NOT NULL,
  `department` varchar(50) NOT NULL,
  `salary` decimal(10,2) NOT NULL,
  `active` tinyint(1) DEFAULT 1,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `e_username` varchar(20) NOT NULL,
  `e_password` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `employee`
--

INSERT INTO `employee` (`emp_id`, `efull_name`, `department`, `salary`, `active`, `created_at`, `e_username`, `e_password`) VALUES
(00000004, 'eiei', 'IT', 15000.00, 1, '2026-04-17 02:41:36', 'admin', '$2y$10$c7uA2CVFW2kfVvRSFzifU.i1sYnLm0HpZXna.gUWz7UVaVeWP8ZVq'),
(00000008, 'Wanida Test', 'HR', 19000.00, 1, '2026-04-23 04:39:46', 'Wanida', '$2y$10$O8wgrq57secwOz4PsYsiauttpkY4ux07xyaUCACkmInRFNAlib1Fq'),
(00000009, 'suthida ruangsuksud', 'IT', 30000.00, 1, '2026-04-28 01:06:21', 'suthida', '$2y$10$6J0hZwAcTMEkWiPMarACpeHqvdBEFi2MqskQlOcdIYfOgEYn.kZ9S');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `attraction`
--
ALTER TABLE `attraction`
  ADD PRIMARY KEY (`att_id`);

--
-- Indexes for table `bookings`
--
ALTER TABLE `bookings`
  ADD PRIMARY KEY (`booking_id`);

--
-- Indexes for table `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`category_id`);

--
-- Indexes for table `customers`
--
ALTER TABLE `customers`
  ADD PRIMARY KEY (`cust_id`);

--
-- Indexes for table `employee`
--
ALTER TABLE `employee`
  ADD PRIMARY KEY (`emp_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `attraction`
--
ALTER TABLE `attraction`
  MODIFY `att_id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=18;

--
-- AUTO_INCREMENT for table `bookings`
--
ALTER TABLE `bookings`
  MODIFY `booking_id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT for table `categories`
--
ALTER TABLE `categories`
  MODIFY `category_id` int(4) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT for table `customers`
--
ALTER TABLE `customers`
  MODIFY `cust_id` int(8) UNSIGNED ZEROFILL NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `employee`
--
ALTER TABLE `employee`
  MODIFY `emp_id` int(8) UNSIGNED ZEROFILL NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
